[
  {
    "title": "A Christian Outlook on Death",
    "slug": "a-christian-outlook-on-death",
    "content": "By Fr. Conor Donnelly(*Proofread*)*In the name of the Father, and of the Son, and of the Holy Spirit,Amen.**My Lord and my God, I firmly believe that you are here, that you seeme, that you hear me. I adore you with profound reverence. I ask yourpardon for my sins, and grace to make this time of prayer fruitful. MyImmaculate Mother, Saint Joseph, my father and lord, my guardian angel,intercede for me.*We can ask Our Lady to accompany us in that happy hour and to help anypeople around us also to find Our Lady and to be with her in that veryspecial moment.*I thank you, my God, for the good resolutions, affections, andinspirations that you have communicated to me during this meditation. Iask your help to put them into practice. My Immaculate Mother, SaintJoseph, my father and lord, my guardian angel, intercede for me.**In the name of the Father, and of the Son, and of the Holy Spirit.Amen.**OLV*"
  },
  {
    "title": "Abandonment",
    "slug": "abandonment",
    "content": "By Fr. Conor Donnelly*(Proofread)**In the name of the Father, and of the Son, and of the Holy Spirit.Amen.**My Lord and my God, I firmly believe that you are here, that you seeme, that you hear me. I adore you with profound reverence. I ask yourpardon for my sins and grace to make this time of prayer fruitful. MyImmaculate Mother, Saint Joseph, my father and lord, my guardian angel,intercede for me.*We are told in the Gospel, \"Can you not buy two sparrows for a penny?Yet not one falls to the ground without your Father knowing\" (Matt.10:29).Mary, may you help me to live that spirit of abandonment in the same waythat you did.*I thank you, my God, for the good resolutions, affections, andinspirations that you have communicated to me during this meditation. Iask your help to put them into practice. My Immaculate Mother, SaintJoseph, my father and lord, my guardian angel, intercede for me.**In the name of the Father, and of the Son, and of the Holy Spirit.Amen.**OLV*"
  }
]